app/Http/Controllers/DashboardController.php

    public function __invoke()
    {
        return view('dashboard', [
            'questions' => Question::withSum('votes', 'like')->withSum('votes', 'unlike')->get()
        ]);
---
select * from `questions`