app/Http/Controllers/QuestionController.php

delete from `questions` where `id` = 2
---
    public function destroy(Question $question)
    {
        $this->authorize('destroy', $question);

        $question->delete();